{"nodes":[{"id":0,"type":3,"values":[{"name":"Name","type":0,"value":"Ziya"},{"name":"Text","type":2,"value":"There I transformed your Candela to Lux. Whenever you need my assistance, you know where to find me. Until then, take care on your quest, and may your light guide you. Goodbye for now, my friend."}]},{"id":1,"next":2,"type":0,"values":[{"name":"Name","type":0,"value":"Ziya"},{"name":"Text","type":2,"value":"Welcome, my dear friend Baldur. It's good to see you again. The darkness grows stronger, but I'm here to help you shine some light on your journey.\nI see you brought {{candela_amount}} candela with you. I can work my magic, transforming it into lux for you.\nBut, before you trade your candela for lux, remember that it's also what keeps your torch burning brightly. Spending too much candela might make your torch shine less brightly and make it harder to navigate the darkness."}]},{"branch_type":0,"branches":[{"next":0,"values":[{"name":"Text","type":1,"value":"10 Candela > 6 Lux"}]},{"next":0,"values":[{"name":"Text","type":1,"value":"50 Candela > 34 Lux"}]},{"next":0,"values":[{"name":"Text","type":1,"value":"100 Candela > 72 Lux"}]},{"next":3,"values":[{"name":"Text","type":1,"value":"Exit"}]}],"id":2,"type":2,"values":[{"name":"Name","type":0,"value":"Ziya"},{"name":"Text","type":2,"value":"Hand me your candela. My magic, dear Baldur, is rooted in the essence of light and darkness. I can transform candela into lux by harnessing the energy of the lumens you've saved, creating a unique exchange between the forces of illumination and obscurity.\nEach piece of candela is a glimmer of hope in this darkness.\nBaldur, how much candela would you like me to transform into lux for you today?"}]},{"id":3,"type":3,"values":[{"name":"Name","type":0,"value":"Ziya"},{"name":"Text","type":2,"value":"I see, Baldur. You're choosing to hold onto your candela for now. That's perfectly fine. Whenever you change your mind or need assistance, you know where to find me. Until then, take care on your quest, and may your light guide you. Goodbye for now, my friend."}]}],"start":1}